[
  {
    "slug": "caregiver-support-mumbai",
    "file": "caregiver_support_mumbai.docx",
    "text": "5 Ways to Support Dementia Caregivers in Mumbai\nAuthor: Echoing Healthy Ageing\nDate: 2024-08-18\nThese five practices make caregiving sustainable without waiting for a crisis.\nCaring for a loved one with dementia is a full-time emotional commitment. Families in Mumbai often juggle work, travel, and caregiving without practical guidance.\nCreate Small Rituals of Connection\nConsistent routines lower stress for the person with dementia and give caregivers breathing space. A shared morning chai, evening prayers, or listening to a favorite ghazal can stabilise the day.\nShare the Care with Community\nMumbai has neighbourhood WhatsApp groups, housing society councils, and local NGOs ready to help. Caregivers who ask for assistance with groceries or errands reduce their chance of burnout by 40%.\nBook Respite Support Early\nMemory Café sessions, home therapy visits, and virtual support circles provide respite before crises happen. Planning these ahead gives caregivers guilt-free downtime.\nKnow When to Call a Professional\nWhen behavioural changes feel overwhelming, dementia-trained counsellors can create a plan. Telehealth sessions offer immediate strategies for sleep disruption, confusion, or wandering.\nCelebrate Every Small Win\nCaregivers often forget to acknowledge their progress. Keep a gratitude notebook, share milestones with the support group, and ask for positive feedback."
  },
  {
    "slug": "caregiver-weekend-checklist",
    "file": "caregiver_weekend_checklist.docx",
    "text": "Weekend Checklist for Dementia Caregivers\nAuthor: Echoing Healthy Ageing\nDate: 2024-09-07\nUse weekends as a gentle reset for the whole family.\nWeekend hours are perfect for light planning. This checklist keeps dementia care organised without feeling overwhelming.\nReview Medication and Supplies\nCount tablets, refill prescriptions, and check mobility aids. Keep a simple log stuck on the fridge so everyone knows what is stocked.\nPlan Social Touchpoints\nLine up phone calls with grandchildren, recorded blessings from loved ones, or a quick video message. Social interactions reduce anxiety for both caregivers and elders.\nRefresh the Calm Corners\nArrange a chair near the window, keep favourite books accessible, and place a basket with sensory tools like stress balls or essential oils.\nSchedule Your Own Rest\nReserve an afternoon nap, a walk along Marine Drive, or a coffee with friends. Caregivers who rest for even 45 minutes report higher patience levels.\nCheck Upcoming EHA Sessions\nLook at the Memory Café calendar, therapy workshops, and tele-consults. Booking in advance ensures consistent support."
  },
  {
    "slug": "memory-cafe-guide",
    "file": "memory_cafe_guide.docx",
    "text": "A First-Timer’s Guide to Memory Café Sessions\nAuthor: Echoing Healthy Ageing\nDate: 2024-07-02\nThis guide helps families arrive prepared, stay relaxed, and continue after the session.\nMemory Café gatherings are gentle social experiences for persons with dementia and their caregivers. Here is how to make the most of your first visit.\nWhat to Expect When You Arrive\nVolunteers welcome you with a warm smile, offer name tags, and introduce a simple sensory activity. The environment is familiar—soft lighting, old Hindi songs, and chairs arranged in circles.\nBring Comfort Items\nCarry a small object that sparks memories—a photo, a prayer book, a piece of fabric. Facilitators use these items to invite stories and connection.\nStay for the Gentle Movement Segment\nFacilitators lead seated stretches inspired by physiotherapy and classical dance mudras. This improves circulation and uplifts mood without exhausting participants.\nUse the Caregiver Circle\nWhile activities run, caregivers step into a short support circle. Questions about medication, sleep routines, and behaviour changes are answered by our dementia coaches.\nFollow Up Within 48 Hours\nWithin two days, send a message or call the facilitator. Share observations, ask for adjustments, and book the next session so you stay connected."
  },
  {
    "slug": "telehealth-benefits",
    "file": "telehealth_benefits.docx",
    "text": "Why Telehealth Matters for Dementia Care in India\nAuthor: Echoing Healthy Ageing\nDate: 2024-05-14\nTelehealth is no longer optional—it is foundational for dignified dementia care.\nIn cities like Mumbai, commuting for dementia consultations is exhausting. Telehealth bridges care gaps with timely, high-quality support.\nSpecialists Wherever You Are\nVideo sessions connect families to neurologists, occupational therapists, and dementia counsellors without travel. Even a 30-minute consult prevents avoidable ER visits.\nContinuity Between In-Person Visits\nFollow-up tele-sessions keep treatment plans updated. Care teams monitor nutrition, mobility, and cognitive stimulation weekly instead of waiting months.\nPrivacy and Dignity at Home\nFamilies often hesitate to discuss behaviour changes in crowded clinics. Telehealth lets them speak freely while the person with dementia experiences less anxiety.\nHow Echoing Healthy Ageing Uses Telehealth\nWe combine video consults with home-based assessments. If we notice early warning signs, we loop in our Memory Café team or therapy partners instantly."
  }
]